Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/supplementary_welfare_schemes/supplementary_welfare_allow.html.txt.tmx
Source language: en
Languages: ga

source: • How to apply • Where to apply
ga: • Conas iarratas a dhéanamh

source: Basic Supplementary Welfare Allowance is a weekly allowance paid to people who do not have enough income to meet their needs and those of their families
ga: Ina theannta sin, is féidir íocaíochtaí a dhéanamh do riachtanais práinneacha agus eisceachtúla

source: If you have no income, you may be entitled to the basic Supplementary Welfare Allowance
ga: Mura bhfuil aon ioncam agat, b'fhéidir go mbeifeá i dteideal do Liúntas Leasa Forlíontach bunúsach

source: If your weekly income is below the Supplementary Welfare Allowance rate for your family size, a payment may be made to bring your income up to the appropriate Supplementary Welfare Allowance rate
ga: Má tá d'ioncam seachtainiúil taobh thíos den ráta Liúntais Leasa Forlíontach do mhéid an teaghlaigh atá agat, d’fhéadfadh íocaíocht a bheith déanta a thugann d'ioncam suas go dtí an ráta oiriúnach Liúntais Leasa Forlíontach

source: If you have claimed a social welfare benefit or pension but it has not yet been paid and you have no other income, you may qualify for basic Supplementary Welfare Allowance while you are waiting for your payment
ga: Má tá éileamh déanta agat ar shochar leasa shóisialaigh nó phinsean ach nach bhfuil sé íoctha fós agus nach bhfuil aon ioncam eile agat, d'fhéadfá cáiliú do Liúntas Leasa Forlíontach nuair atá tú ag fanacht ar íocaíocht

source: You will normally qualify for Supplementary Welfare Allowance if you satisfy the following conditions:
ga: Cáileoidh tú go hiondúil do Liúntas Leasa Forlíontach má shásaíonn tú na coinníollacha a leanas:

source: • You are living in the State
ga: • Tá tú i do chónaí sa Stát

source: • You satisfy the means test
ga: • Sásaíonn tú an tástáil acmhainne

source: • You have applied for any other benefit or allowance you may be entitled to
ga: • Tá tú tar éis iarratas a dhéanamh ar shochar/liúntas ar bith eile go bhféadfá a bheith i dteideal dóibh

source: • You have registered for work with your local Intreo Centre if you are of working age
ga: • Sásaíonn tú an coinníoll gnáth-chónaithe, ach amháin i gcás den Íocaíochta do Riachtanais Eisceachtúla

source: • You satisfy the habitual residence condition
ga: Sásóidh oibrithe AE/LEE an coinníoll gnáthchónaithe

source: • EU/EEA and Swiss migrant workers who have been working in Ireland can access basic SWA and supplements without having habitual residence assessed, provided they have the right to reside in Ireland
ga: • Tá tú cláraithe chun oibre le FÁS má tá tú in aois oibre

source: You will not normally qualify for basic Supplementary Welfare Allowance if you are:
ga: Ní cháileoidh tú go hiondúil do Liúntas Leasa Forlíontach má tá tú

source: • In full-time work, that is, working for more than 30 hours per week*
ga: • In obair lánaimseartha, is é sin, ag obair níos mó ná 30 uair a' chloig in aghaidh na seachtaine

source: • Involved in a trade dispute
ga: • Bainteach i ndíospóid trádála

source: However, you may claim Supplementary Welfare Allowance for your dependants
ga: D'fhéadfá Liúntas Leasa Forlíontach a éileamh do do chleithiúnaithe, áfach

source: The main items taken into account for the means test include: All cash income
ga: Siad na míreanna a leanas na príomhrudaí a thógtar san áireamh don tástáil acmhainne:

source: Most social welfare and Health Service Executive payments, except Child Benefit, Domiciliary Care Allowance and Blind Welfare Allowance, Guardian's Payment (Contributory), Guardian's Payment (Non-Contributory) and the Carer's Support Grant
ga: Iomlán an ioncaim airgead tirim, a chuimsíonn formhór íocaíochtaí leasa shóisialaigh agus Feidhmeannachta na Seirbhíse Sláinte, lasmuigh de Shochar Leanaí, Liúntas um Chúram Baile agus Liúntas Leasa do Dhaille

source: All financial compensation except compensation awarded by a court to certain people (see 'Further information' below for details of compensation payments.)
ga: Ó Mheitheamh 2007, ní ghlactar san áireamh Íocaíocht Caomhnóra (Ranníocach), Íocaíocht Caomhnóra (Neamh-Ranníocach) agus Deontas um Chúram Faoisimh sa tástáil acmainne le haghaidh Liúntas Leasa Forlíontach

source: Rehabilitative employment: Up to €120 from rehabilitative employment is disregarded
ga: Fostaíocht athshlánúcháin: Déantar neamhaird ar suas le €120 ón bhfostaíocht athshlánúcháin

source: The value of any benefit or privilege: If you are 24 years of age or under and you are living with a parent or a step-parent in the family home, some of your parents' income will also be taken into account in the assessment for Supplementary Welfare Allowance
ga: Luach aon sochair nó pribhléide: Má tá tú 24 bliana d’aois nó faoina bhun agus má tá tú i do chónaí le tuismitheoir nó le leastuismitheoir in áras an teaghlaigh, cuirfear cuid d’ioncam do thuismitheoirí san áireamh nuair atá measúnú á dhéanamh ó thaobh Liúntais Leasa Forlíontaigh

source: The Department of Social Protection calls this an assessment of the 'benefit and privilege' you get from living with your parents
ga: Is éard a thugann an Roinn Coimirce Sóisialaí air seo ná measúnú an ‘tsochair agus na pribhléide’ a fhaigheann tú de thoradh bheith i do chónaí le do thuismitheoirí

source: The value of investments, savings or property (but not the value of your own home) is calculated as follows:
ga: Tá tuilleadh eolais sa doiciméid maidir le conas a dhéantar sochar agus pribhléid a mheasúnú i dtástáil mhaoine

source: │Capital │Weekly means assessed │
ga: │Caipiteal │Acmhainn sheachtainiúil │ │ │mheasúnaithe │

source: │First €5,000 │not taken into account │
ga: │An chéad €5,000 │Ní ghlactar san áireamh │

source: │Next €10,000 │€1 per €1,000 │
ga: │An chéad €10,000 │€1 sa €1,000 │

source: │Next €25,000 │€2 per €1,000 │
ga: │An chéad €25,000 │€2 sa €1,000 │

source: │Balance │€4 per €1,000 │
ga: │Iarmhéid │€4 sa €1,000 │

source: If you are married, in a civil partnership or cohabiting your total income is added together in the means test
ga: I gcás lánúin phósta, páirtnéirí sibhialta nó comhchónaitheoirí, suimítear ioncam na beirte san áireamh nuair déantar an teastas mhaoine

source: Repayment of Supplementary Welfare Allowance
ga: Aisíocaíocht an Liúntais Leasa Forlíontach

source: In certain circumstances, you may have to repay any assistance you have received under the Supplementary Welfare Allowance Scheme
ga: I gcúinsí áirithe, b'fhéidir go mbeadh ort aon chúnamh a fuair tú faoin Scéim Liúntais Leasa Forlíontach a aisíoc

source: If basic Supplementary Welfare Allowance is paid while you are waiting for a social welfare benefit, assistance or pension, the amount paid will be deducted from the arrears of your social welfare payment
ga: Má íoctar Liúntas Leasa Forlíontach leat nuair atá tú ag fanacht le sochar leasa shóisialaigh, cúnamh nó pinsean, déanfar an méid a íocadh a asbhaint ó riaráistí d'íocaíocht leasa shóisialaigh

source: The basic Supplementary Welfare Allowance is made up of a personal rate for the applicant and additional amounts for any adult dependant and/or child dependant(s)
ga: Tá an Liúntas Leasa Forlíontach déanta suas as ráta pearsanta don iarrthóir agus méideanna breise do dhuine fásta cleithiúnach agus/nó do pháistí cleithiúnacha

source: A child dependant is a person under the age of 18 who lives with you and depends on you for financial support
ga: Is páiste cleithiúnach duine faoi 18 bliana d'aois a chónaíonn leat agus atá ag brath ort i gcomhair tacaíocht airgeadais

source: If you have been getting SWA for at least 26 weeks, the age limit is 22 for a child dependant in full-time education or up to the end of the academic year after their 22nd birthday
ga: Is é an teorainn aoise do pháiste cleithiúnach atá ag fáil oideachas lánaimseartha ná 22 bliain d'aois. Má tá an liúntas leasa forlíontach príomhá i bhfeidhm le 27 seachtaine nó níos mó leanfaidh an íocaíocht ar aghaidh go dtí deireadh na bliana acadúla i ndiaidh an breithlá sin

source: Supplementary Welfare Allowance rates in 2016 and up to 13 March 2017
ga: Rátaí Líuntas Leasa Forlíontach í 2016 agus roimh 13 Márta 2017

source: │Aged 26 and │€186.00 │€124.80 │€29.80 │
ga: Uasráta Líuntais Leasa Forlíontaigh do dhuine 26 bliana d'aois nó níos sine

source: │over │ │ │ │
ga: │Uasráta │€186 │€124.80 │€29.80 │

source: │Aged 25 │€144.00 │€124.80 │n/a │
ga: Uasráta Líuntais Leasa Forlíontaigh do dhuine faoi 25 bliana d'aois

source: Supplementary Welfare Allowance rates from 13 March 2017
ga: Rátaí Líuntas Leasa Forlíontach ó 13 Márta 2017

source: │Age │Maximum personal │Increase for a qualified │Increase for a qualified │
ga: Uasráta Líuntais Leasa Forlíontaigh do dhuine 26 bliana d'aois nó níos sine

source: │ │rate │adult │child │
ga: │ │Ráta pearsanta │Méadú do Dhuine Fásta Cáilithe │Ardú Cleithiúnaí Linbh │

source: │Aged 26 and │€191.00 │€128.10 │€29.80 │
ga: │Uasráta │€191.00 │€128.10 │€29.80 │

source: │Aged 25 │€147.80 │€128.10 │n/a │
ga: Uasráta Líuntais Leasa Forlíontaigh do dhuine faoi 25 bliana d'aois

source: Reduced rates of Supplementary Welfare Allowance for claimants under 26 years of age do not apply to:
ga: Mar sin féin, ní bheidh an ráta pearsanta laghdaithe agus ráta d’aosach cáilithe an Liúntais Leasa Forlíontaigh maidir le héilitheoirí faoi bhun 26 bliana d’aois infheidhmithe sna cásanna a leanas:

source: • People with dependent children
ga: • Éilitheoirí a bhfuil leanaí cleithiúnacha acu

source: You should apply for Supplementary Welfare Allowance to the Department of Social Protection's Community Welfare Service at your local office as soon as the need arises
ga: Ba cheart duit iarratas ar Liúntas Leasa Forlíontach a dhéanamh chuig an Oifigeach Leasa Phobail ag d'ionad sláinte áitiúil chomh luath agus a bhíonn an gá ann

source: You must fill in a Supplementary Welfare Allowance claim form (pdf)
ga: Ní mór duit foirm iarratais Liúntais Leasa Fhorlíontaigh (pdf) a chomhlánú ach cabhróidh an tOifigeach Leasa Phobail leat

source: To help process your claim, you should have the following:
ga: Chun cabhrú led' iarratas, ba cheart duit na rudaí seo a leanas a bheith agat:

source: • Personal Public Service (PPS) numbers (formerly RSI numbers) for yourself, your spouse, civil partner or cohabitant and your children
ga: • Uimhir Phearsanta Sheirbhís Phoiblí (UPSP) (uimhir RSI roimhe seo) duit féin, do chéile/pháirtnéir sibhialta/chomhchónaitheoir agus do pháistí

source: • Proof of identity, for example, a Public Services Card (if you have one), a passport, driving licence, work permit, immigration (GNIB) card, etc
ga: • Cruthúnas aitheantas , mar shampla, pas, ceadúnas tiománaí, cead oibre, cárta inimirce (BNGSI)

source: • Evidence of any household income
ga: • Cruthúnas de aon ioncam atá tú agus do chéile/pháirtnéir sibhialta/chomhchónaitheoir agus do leanaí ag fáil

source: • Birth certificates for any children you include in your application
ga: • Do Leabhar Sochar Leanaí nó Teastais Bhreithe do aon pháistí a bhfuil tú déanamh éileamh dóibh muna bhfuil UPSP agat dóibh

source: • Documents to show your income and financial situation, such as, pay slips, P45, P35, P60, bank statements, etc
ga: • Doiciméid mar cruthú d'ioncam agus do staid airgeadais, mar shampla, duillíní pá, P45, P35, P60, ráitis bhainc

source: You have the right to appeal against a decision if you are not satisfied with the outcome of your claim. You can appeal to the independent Social Welfare Appeals Office
ga: Mura bhfuil tú sásta leis an toradh d'achomhairc Feidhmeannachta na Seirbhíse Sláinte, is féidir leat achomharc ar an Oifig Achomharc Leasa Shóisialaigh neamhspleách a dhéanamh

source: The Social Welfare Appeals Office deals with appeals relating to basic SWA and SWA supplements. Where to apply
ga: Bíonn an Oifig Achomharc Leasa Shóisialaigh ag déileáil le hachomhairc faoi LLF bunúsach agus forlíonta LLF

source: You should contact the Department of Social Protection's Community Welfare Service at your local office
ga: Áfach ní dhéanann an Oifig cinntí maidir le hÍocaíochtaí Riachtanais Eisceachtúil nó Práinneach

source: Compensation from the following sources is not assessed:
ga: Déan teagmháil le d'ionad áitiúil sláinte
